package IO;
/**
 * Потбібно не забувати при наслідуванні інтерфес і 
 * іншого інтерфейсу ми пишемо extends))))
 * 
 *default ..... {} в інтерфейсі що це і для чого
 *З 7 джава ми може робити реалізація метода в середині інтерфейса
 *який використовує ті методи які в інших ітерфесах реалізовані і наслудувані
 *
 *
 * @author Ростислав
 *
 */
public interface iData extends iReader, iPrinter {

	default int input(String text) { // метод імпут який примає строчку текста і зчитує дані (метод вводу і вводу)
		print(text);
		return read();
	}
}
